scare66cro/Constellation/Nova_Firmware/lp_am2434/watchdog_core/example.syscfg
/**
 * Constellation Nova — independent watchdog core (R5FSS1_0)
 *
 * Minimal NoRTOS image: DWWD + DebugP UART + MPU mapping for the
 * shared MSRAM heartbeat region. Deliberately ZERO ethernet, ZERO
 * IPC subsystem, ZERO OSPI — the whole point of this core is that
 * it has nothing it can hang waiting for.
 *
 * Memory layout (matches docs/lp-am2434-watchdog-design.md §3):
 *   R5F_VECS    : 0x40 in cluster-1 TCMA
 *   R5F_TCMA    : remaining ~32 KB of cluster-1 TCMA (stacks)
 *   MSRAM       : 0x701E0000-0x701FFFFF (128 KB) — code/data/.bss
 *   USER_SHM    : 0x701DFFC0 (64 B) — heartbeat struct (NOT loaded
 *                 from this image; main core owns the load, we
 *                 just read/write it via raw pointer)
 *
 * UART for boot trace: USART1 (the "second" UART on the LP, free
 * because main core owns USART0/UART2 for the bridge protocol).
 * If USART1 isn't pinned out on a given board, comment out the
 * debug_log block — the watchdog still functions silently.
 *
 * @cliArgs --device "AM243x_ALX_beta" --package "ALX" --part "ALX" --context "r5fss1-0" --product "MCU_PLUS_SDK_AM243x@12.00.00"
 */

const watchdog        = scripting.addModule("/drivers/watchdog/watchdog", {}, false);
const watchdog1       = watchdog.addInstance();
const debug_log       = scripting.addModule("/kernel/dpl/debug_log");
const dpl_cfg         = scripting.addModule("/kernel/dpl/dpl_cfg");
const mpu_armv7       = scripting.addModule("/kernel/dpl/mpu_armv7", {}, false);
const mpu_armv71      = mpu_armv7.addInstance();
const mpu_armv72      = mpu_armv7.addInstance();
const mpu_armv73      = mpu_armv7.addInstance();
const mpu_armv74      = mpu_armv7.addInstance();
const default_linker  = scripting.addModule("/memory_configurator/default_linker", {}, false);
const default_linker1 = default_linker.addInstance();
const general         = scripting.addModule("/memory_configurator/general", {}, false);
const general1        = general.addInstance();
const region          = scripting.addModule("/memory_configurator/region", {}, false);
const region1         = region.addInstance();
const section         = scripting.addModule("/memory_configurator/section", {}, false);
const section1        = section.addInstance();
const section2        = section.addInstance();
const section3        = section.addInstance();
const section4        = section.addInstance();
const section5        = section.addInstance();
const section6        = section.addInstance();
const section7        = section.addInstance();

/* ─── Watchdog: reset-on-expire, 10 s open window ──────────────────
 * The 10 s window must be longer than the worst-case time between
 * heartbeat polls (we poll at 100 Hz, so ~10 ms) plus the strobe-
 * stale grace (5 s). 10 s leaves ~5 s of margin. */
watchdog1.$name          = "CONFIG_WDT0";
watchdog1.expirationTime = 10000;
watchdog1.resetMode      = "Watchdog_RESET_ON";

/* ─── Boot UART (optional life-sign) ───────────────────────────────
 * Use USART1 so we don't collide with main core on USART0/UART2.
 * Disable this whole block if USART1 isn't pinned out — the
 * watchdog still works without console output. */
debug_log.enableUartLog        = true;
debug_log.uartLog.$name        = "CONFIG_UART0";
debug_log.uartLog.UART.$assign = "USART1";

/* ─── MPU regions ──────────────────────────────────────────────────
 * Only what cluster 1 actually touches: device space (default),
 * MSRAM (cacheable RW for code+data), and the FLASH base for
 * future XIP if ever needed. */
mpu_armv71.$name             = "CONFIG_MPU_REGION0";
mpu_armv71.size              = 31;
mpu_armv71.attributes        = "Device";
mpu_armv71.accessPermissions = "Supervisor RD+WR, User RD";
mpu_armv71.allowExecute      = false;

mpu_armv72.$name             = "CONFIG_MPU_REGION1";  /* TCMA */
mpu_armv72.size              = 15;
mpu_armv72.accessPermissions = "Supervisor RD+WR, User RD";

mpu_armv73.$name             = "CONFIG_MPU_REGION2";  /* TCMB @ 0x41010000 */
mpu_armv73.baseAddr          = 0x41010000;
mpu_armv73.size              = 15;
mpu_armv73.accessPermissions = "Supervisor RD+WR, User RD";

mpu_armv74.$name             = "CONFIG_MPU_REGION3";  /* MSRAM 2 MB cacheable */
mpu_armv74.baseAddr          = 0x70000000;
mpu_armv74.size              = 21;
mpu_armv74.accessPermissions = "Supervisor RD+WR, User RD";

default_linker1.$name = "memory_configurator_default_linker0";
general1.$name        = "CONFIG_GENERAL0";
general1.linker.$name = "TIARMCLANG0";

/* ─── Memory regions ───────────────────────────────────────────────
 * Cluster-1 TCMA + a 128 KB carve-out of MSRAM at the top of the
 * 2 MB block (above the main core's 0x15FFC0 region). */
region1.$name                               = "MEMORY_REGION_CONFIGURATION0";
region1.memory_region.create(4);
region1.memory_region[0].type               = "TCMA_R5F";
region1.memory_region[0].$name              = "R5F_VECS";
region1.memory_region[0].size               = 0x40;
region1.memory_region[0].auto               = false;
region1.memory_region[1].type               = "TCMA_R5F";
region1.memory_region[1].$name              = "R5F_TCMA";
region1.memory_region[1].size               = 0x7FC0;
region1.memory_region[2].type               = "TCMB_R5F";
region1.memory_region[2].$name              = "R5F_TCMB0";
region1.memory_region[2].size               = 0x8000;
region1.memory_region[3].$name              = "MSRAM";
region1.memory_region[3].auto               = false;
region1.memory_region[3].manualStartAddress = 0x701E0000;
region1.memory_region[3].size               = 0x20000;  /* 128 KB */

/* ─── Sections ────────────────────────────────────────────────────*/
section1.$name                        = "Vector Table";
section1.load_memory                  = "R5F_VECS";
section1.group                        = false;
section1.output_section.create(1);
section1.output_section[0].$name      = ".vectors";
section1.output_section[0].palignment = true;

section2.$name                        = "Text Segments";
section2.load_memory                  = "MSRAM";
section2.output_section.create(5);
section2.output_section[0].$name      = ".text.hwi";
section2.output_section[0].palignment = true;
section2.output_section[1].$name      = ".text.cache";
section2.output_section[1].palignment = true;
section2.output_section[2].$name      = ".text.mpu";
section2.output_section[2].palignment = true;
section2.output_section[3].$name      = ".text.boot";
section2.output_section[3].palignment = true;
section2.output_section[4].$name      = ".text:abort";
section2.output_section[4].palignment = true;

section3.$name                        = "Code and Read-Only Data";
section3.load_memory                  = "MSRAM";
section3.output_section.create(2);
section3.output_section[0].$name      = ".text";
section3.output_section[0].palignment = true;
section3.output_section[1].$name      = ".rodata";
section3.output_section[1].palignment = true;

section4.$name                        = "Data Segment";
section4.load_memory                  = "MSRAM";
section4.output_section.create(1);
section4.output_section[0].$name      = ".data";
section4.output_section[0].palignment = true;

section5.$name                                   = "Memory Segments";
section5.load_memory                             = "MSRAM";
section5.output_section.create(3);
section5.output_section[0].$name                 = ".bss";
section5.output_section[0].palignment            = true;
section5.output_section[0].output_sections_start = "__BSS_START";
section5.output_section[0].output_sections_end   = "__BSS_END";
section5.output_section[1].$name                 = ".sysmem";
section5.output_section[1].palignment            = true;
section5.output_section[2].$name                 = ".stack";
section5.output_section[2].palignment            = true;

section6.$name                                    = "Stack Segments";
section6.load_memory                              = "R5F_TCMA";
section6.output_section.create(5);
section6.output_section[0].$name                  = ".irqstack";
section6.output_section[0].output_sections_start  = "__IRQ_STACK_START";
section6.output_section[0].output_sections_end    = "__IRQ_STACK_END";
section6.output_section[0].input_section.create(1);
section6.output_section[0].input_section[0].$name = ". = . + __IRQ_STACK_SIZE;";
section6.output_section[1].$name                  = ".fiqstack";
section6.output_section[1].output_sections_start  = "__FIQ_STACK_START";
section6.output_section[1].output_sections_end    = "__FIQ_STACK_END";
section6.output_section[1].input_section.create(1);
section6.output_section[1].input_section[0].$name = ". = . + __FIQ_STACK_SIZE;";
section6.output_section[2].$name                  = ".svcstack";
section6.output_section[2].output_sections_start  = "__SVC_STACK_START";
section6.output_section[2].output_sections_end    = "__SVC_STACK_END";
section6.output_section[2].input_section.create(1);
section6.output_section[2].input_section[0].$name = ". = . + __SVC_STACK_SIZE;";
section6.output_section[3].$name                  = ".abortstack";
section6.output_section[3].output_sections_start  = "__ABORT_STACK_START";
section6.output_section[3].output_sections_end    = "__ABORT_STACK_END";
section6.output_section[3].input_section.create(1);
section6.output_section[3].input_section[0].$name = ". = . + __ABORT_STACK_SIZE;";
section6.output_section[4].$name                  = ".undefinedstack";
section6.output_section[4].output_sections_start  = "__UNDEFINED_STACK_START";
section6.output_section[4].output_sections_end    = "__UNDEFINED_STACK_END";
section6.output_section[4].input_section.create(1);
section6.output_section[4].input_section[0].$name = ". = . + __UNDEFINED_STACK_SIZE;";

section7.$name                        = "Initialization and Exception Handling";
section7.load_memory                  = "MSRAM";
section7.output_section.create(3);
section7.output_section[0].$name      = ".ARM.exidx";
section7.output_section[0].palignment = true;
section7.output_section[1].$name      = ".init_array";
section7.output_section[1].palignment = true;
section7.output_section[2].$name      = ".fini_array";
section7.output_section[2].palignment = true;

/* ─── Pinmux solution ──────────────────────────────────────────────*/
debug_log.uartLog.UART.RXD.$suggestSolution = "UART1_RXD";
debug_log.uartLog.UART.TXD.$suggestSolution = "UART1_TXD";
